
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Выгрузка.ОбъектВыгрузки КАК ОбъектЗагрузки
	|ИЗ
	|	РегистрСведений.Выгрузка КАК Выгрузка";
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	Если РезультатЗапроса.Количество() > 0 Тогда 
		табОбъекты.Загрузить(РезультатЗапроса);
	Иначе
		Сообщить("Все данные сохранены!");		
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура СохранитьНаСервере()
	Для каждого об из табОбъекты Цикл
		Если ТипЗнч(об) = Тип("ДокументСсылка.Игра") Тогда 
			//
		ИначеЕсли ТипЗнч(об.ОбъектЗагрузки) = Тип("СправочникСсылка.Соревнование") Тогда 
			сорев = об.ОбъектЗагрузки.ПолучитьОбъект();
			Если НЕ ЗначениеЗаполнено(сорев.УИД) Тогда 
				сервис = WSСсылки.WSTenis.СоздатьWSПрокси("WSTenis", "WSTenis", "WSTenisSoap12");
				ид = сервис.CreateCmpt(СТРОКА(Константы.ГУИД.Получить()), 
				сорев.Наименование, 
				ФОРМАТ(сорев.ДатаПроведения, "ДФ=yyyy-MM-dd"),
				сорев.МестоПроведения);                            
				сорев.УИД = Новый УникальныйИдентификатор(ид);
				сорев.Записать();
			Иначе
				сервис = WSСсылки.WSTenis.СоздатьWSПрокси("WSTenis", "WSTenis", "WSTenisSoap12");
				ид = сервис.UpdateCmpt(СТРОКА(сорев.УИД), 
				сорев.Наименование, 
				ФОРМАТ(сорев.ДатаПроведения, "ДФ=yyyy-MM-dd"),
				сорев.МестоПроведения, 
				сорев.Место);                            
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура Сохранить(Команда)
	СохранитьНаСервере();
КонецПроцедуры
